
# 11 = "Напишите программу для решения примера (по вариантам).
# Предусмотрите проверку деления на ноль. Все необходимые переменные
# пользователь вводит через консоль. Запись |пример| означает «взять по
# модулю», т.е. если значение получится отрицательным, необходимо
# сменить знак с минуса на плюс."
# 12 = "Дан произвольный список, содержащий и строки и числа. Выведите все нечетные элементы в одной строке."
# 13 = "Дан произвольный список, содержащий только числа. Выведите результат умножения всех чисел меньше 10."
# 14 = "Дан произвольный список, содержащий только числа. Выведите число, находящееся посередине массива."
# 21 = "Пусть задано некоторое число my_number. Пользователь вводит с
# клавиатуры свое число user_number. Запрашивайте у пользователя вводить число user_number до
# тех пор, пока оно не будет больше my_number.
# "
# 22 = "Пусть задан список, содержащий строки. Выведите все строки, начинающиеся с буквы r."
# 23 = "Сгенерируйте и выведите случайную строку, состоящую из 8 символов и
# содержащую цифры и буквы. Строка должна содержать хотя бы одну цифру."
# 24 = "Пусть дана строка: На основе данной строки сформируйте две новые. Первая
# строка содержит только цифры, вторая — только буквы.
# Выведите новые строки построчно."